app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Crazy Good Article"], ["body", "This article rocks!"], ["created_at", "2020-09-12 13:43:35.049562"], ["updated_at", "2020-09-12 13:43:35.049562"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "This article rocks!!"], ["updated_at", "2020-09-12 13:43:44.119469"], ["id", 1]]